AlfaLoop/alfabase/arch/cortex-m0/nrf51822/dev/sensor/mpu9250-motion-arch.c
/**
 *  Copyright (c) 2016 AlfaLoop Technology Co., Ltd. All Rights Reserved.
 *
 *  Unauthorized copying of this file, via any medium is strictly prohibited
 *  Proprietary and confidential.
 *
 *  Attribution - You must give appropriate credit, provide a link to the license, and
 *  indicate if changes were made. You may do so in any reasonable manner, but not in any
 *  way that suggests the licensor endorses you or your use.
 *
 *  NonCommercial - You may not use the material for commercial purposes under unauthorized.
 *
 *  NoDerivatives - If you remix, transform, or build upon the material, you may not
 *  distribute the modified material.
 */
#include "contiki.h"
#include "mpu9250-motion-arch.h"
#include <stdint.h>
#include <stdbool.h>
#include <math.h>
#include "dev/i2c.h"
#include "dev/spi.h"
#include "dev/sensors.h"
#include "dev/power.h"
#include "frameworks/app_eventpool.h"
#include "frameworks/app_lifecycle.h"
#include "dev/sensor/inv_mpu/inv_mpu.h"
#include "dev/sensor/inv_mpu/inv_mpu_dmp_motion_driver.h"
#include "dev/sensor/inv_mpu/mllite/invensense.h"
#include "dev/sensor/inv_mpu/mpl/invensense_adv.h"
#include "dev/sensor/inv_mpu/eMPL-hal/eMPL_outputs.h"
#include "dev/sensor/inv_mpu/include/mltypes.h"
#include "dev/sensor/inv_mpu/include/mpu.h"

#include "gpiote.h"
#include "nrf_gpio.h"
#include "sys/clock.h"
#include "errno.h"
#include "bsp_init.h"
#if defined(USE_WDUI_STACK)
#include "wdui/wdui.h"
#endif
/*---------------------------------------------------------------------------*/
#if defined(DEBUG_ENABLE)
#define DEBUG_MODULE 1
#if DEBUG_MODULE
#include "dev/syslog.h"
#define PRINTF(...) syslog(__VA_ARGS__)
#else
#define PRINTF(...)
#endif  /* DEBUG_MODULE */
#else
#define PRINTF(...)
#endif  /* DEBUG_ENABLE */
/*---------------------------------------------------------------------------*/
#if defined(INV_MPU_TWI_DRIVER_CONF)
#define TWI INV_MPU_TWI_DRIVER_CONF
#else
#error Need define INV_MPU_TWI_DRIVER_CONF driver instance
#endif
extern const struct i2c_driver TWI;
extern const struct spi_driver spi1_driver;

/*---------------------------------------------------------------------------*/

/* Data read from MPL. */
#define PRINT_ACCEL     (0x01)
#define PRINT_GYRO      (0x02)
#define PRINT_QUAT      (0x04)
#define PRINT_COMPASS   (0x08)
#define PRINT_EULER     (0x10)
#define PRINT_ROT_MAT   (0x20)
#define PRINT_HEADING   (0x40)
#define PRINT_PEDO      (0x80)
#define PRINT_LINEAR_ACCEL (0x100)
#define PRINT_GRAVITY_VECTOR (0x200)

#define ACCEL_ON        (0x01)
#define GYRO_ON         (0x02)
#define COMPASS_ON      (0x04)

#define MOTION          (0)
#define NO_MOTION       (1)
#define DEFAULT_MPU_HZ  (20)

#define PEDO_READ_MS    (1000)
#define TEMP_READ_MS    (500)
#define COMPASS_READ_MS (100)

#define constrain(amt,low,high) ((amt)<(low)?(low):((amt)>(high)?(high):(amt)))

#define PI 3.14159265358979323846
#define MAX_DMP_SAMPLE_RATE 200           // Maximum sample rate for the DMP FIFO (200Hz)
#define FIFO_BUFFER_SIZE 512              // Max FIFO buffer size

#define MPU9250_ACCEL_COUNTS_2G     			0.00006;
#define MPU9250_ACCEL_COUNTS_4G     			0.00012;
#define MPU9250_ACCEL_COUNTS_8G     			0.00024;
#define MPU9250_ACCEL_COUNTS_16G     			0.00048;

#define MPU9250_GYRO_COUNTS_250     			0.00762;
#define MPU9250_GYRO_COUNTS_500     			0.01525;
#define MPU9250_GYRO_COUNTS_1000     			0.03051;
#define MPU9250_GYRO_COUNTS_2000     			0.06103;

#define MPU9250_COMPASS_COUNTS_4800ut     0.58593;

struct hal_s {
  unsigned char lp_accel_mode;
  unsigned char sensors;
  unsigned char dmp_on;
  unsigned char wait_for_tap;
  volatile unsigned char new_gyro;
  unsigned char motion_int_mode;
  unsigned long no_dmp_hz;
  unsigned long next_pedo_ms;
  unsigned long next_temp_ms;
  unsigned long next_compass_ms;
  unsigned short dmp_features;
};
static struct hal_s hal = {0};
unsigned char *mpl_key = (unsigned char*)"eMPL 5.1";

/* Platform-specific information. Kinda like a boardfile. */
struct platform_data_s {
    signed char orientation[9];
};

/* The sensors can be mounted onto the board in any orientation. The mounting
 * matrix seen below tells the MPL how to rotate the raw data from the
 * driver(s).
 * TODO: The following matrices refer to the configuration on internal test
 * boards at Invensense. If needed, please modify the matrices to match the
 * chip-to-body matrix for your particular set up.
 */
static struct platform_data_s gyro_pdata = {
    .orientation = { 1, 0, 0,
                     0, 1, 0,
                     0, 0, 1}
};

static struct platform_data_s compass_pdata = {
    .orientation = { 0, 1, 0,
                     1, 0, 0,
                     0, 0, -1}
};
#define COMPASS_ENABLED 1

const signed char default_orientation[9] = {
	1, 0, 0,
	0, 1, 0,
	0, 0, 1
};

struct features_s {
  float accel[3];
  int32_t accel_data[3];
  uint32_t accel_ts;

  float gyro[3];
  int32_t gyro_data[3];
  uint32_t gyro_ts;

  float compass[3];
  int32_t compass_data[3];
  uint32_t compass_ts;

  float quat[4];
  int32_t quat_data[4];
  uint32_t quat_ts;

  float euler[3];
  int32_t euler_data[3];
  uint32_t euler_ts;
  float linear_accel[3];
  uint32_t linear_accel_ts;
  float gravity[3];
  uint32_t gravity_ts;
  float heading;
  int32_t heading_data;
  uint32_t heading_ts;
};
static struct features_s features = {0};
static bool motion_active = false;
static motion_data_update_func_t 	m_framework_raw_data_func;
PROCESS(mpu9250_process, "Mpu9250 process");
process_event_t mpu9250_sensor_event;
/*---------------------------------------------------------------------------*/
static float
quaternion_to_float(long number, unsigned char q)
{
	unsigned long mask;
	for (int i=0; i<q; i++)
	{
		mask |= (1<<i);
	}
	return (number >> q) + ((number & mask) / (float) (2<<(q-1)));
}
/*---------------------------------------------------------------------------*/
static float
calc_quaternion(long axis)
{
	return quaternion_to_float(axis, 30);
}
/*---------------------------------------------------------------------------*/
/* Get data from MPL.
 * TODO: Add return values to the inv_get_sensor_type_xxx APIs to differentiate
 * between new and stale data.
 */
static void
read_from_mpl(void)
{
  long msg, data[9];
  int8_t accuracy;
  unsigned long timestamp;
  float float_data[3] = {0};
  uint32_t data_update = 0;

  if (!motion_active) {
    return;
  }

