AlfaLoop/alfabase/arch/cortex-m0/nrf51822/dev/sensor/mpu9250-motion-arch.c
  if (inv_get_sensor_type_quat(data, &accuracy, (inv_time_t*)&timestamp)) {
    /* Sends a quaternion packet to the PC. Since this is used by the Python
    * test app to visually represent a 3D quaternion, it's sent each time
    * the MPL has new data.
    */
    float qw = (float)data[0];
    float qx = (float)data[1];
    float qy = (float)data[2];
    float qz = (float)data[3];

    features.quat_data[0] = (int32_t)data[0];
    features.quat_data[1] = (int32_t)data[1];
    features.quat_data[2] = (int32_t)data[2];
    features.quat_data[3] = (int32_t)data[3];
    features.quat_ts = timestamp;
    // 1073741824

    features.quat[0] = calc_quaternion(qw);
    features.quat[1] = calc_quaternion(qx);
    features.quat[2] = calc_quaternion(qy);
    features.quat[3] = calc_quaternion(qz);

    data_update |= MOTIONFUSION_QUAT;

    PRINTF("[mpu9250 arch] Quat: %f %f %f %f Time: %d ms\n",
      features.quat[0], features.quat[1], features.quat[2], features.quat[3], timestamp);
  }

  if (inv_get_sensor_type_accel(data, &accuracy, &timestamp)) {
    features.accel[0] = (int32_t)data[0] * 1.0 / 65536.0;
    features.accel[1] = (int32_t)data[1] * 1.0 / 65536.0;
    features.accel[2] = (int32_t)data[2] * 1.0 / 65536.0;
    features.accel_data[0] = (int32_t)data[0];
    features.accel_data[1] = (int32_t)data[1];
    features.accel_data[2] = (int32_t)data[2];
    features.accel_ts = timestamp;
    data_update |= MOTIONFUSION_ACCEL;
    // PRINTF("[mpu9250 arch] AccX/Y/Z: %f %f %f Time: %d ms\n", features.accel[0], features.accel[1], features.accel[2], timestamp);
  }

  if (inv_get_sensor_type_gyro(data, &accuracy, &timestamp)) {
    features.gyro[0] = (int32_t)data[0] * 1.0 / 65536.0;
    features.gyro[1] = (int32_t)data[1] * 1.0 / 65536.0;
    features.gyro[2] = (int32_t)data[2] * 1.0 / 65536.0;
    features.gyro_data[0] = (int32_t)data[0];
    features.gyro_data[1] = (int32_t)data[1];
    features.gyro_data[2] = (int32_t)data[2];
    features.gyro_ts = timestamp;

    data_update |= MOTIONFUSION_GYRO;

    // PRINTF("[mpu9250 arch] GyroX/Y/Z: %f %f %f Time: %d ms\n",
    //     features.gyro[0], features.gyro[1], features.gyro[2], timestamp);
  }

  if (inv_get_sensor_type_compass(data, &accuracy, &timestamp)) {
    features.compass[0] = (int32_t)data[0] * 1.0 / 65536.0;
    features.compass[1] = (int32_t)data[1] * 1.0 / 65536.0;
    features.compass[2] = (int32_t)data[2] * 1.0 / 65536.0;
    features.compass_data[0] = (int32_t)data[0];
    features.compass_data[1] = (int32_t)data[1];
    features.compass_data[2] = (int32_t)data[2];
    features.compass_ts = timestamp;

    data_update |= MOTIONFUSION_COMPASS;

    // PRINTF("[mpu9250 arch] CompassX/Y/Z: %f %f %f Time: %d ms\n",
    //     features.compass[0], features.compass[1], features.compass[2], timestamp);
  }

  if (inv_get_sensor_type_euler(data, &accuracy, &timestamp)) {
    features.euler[0] = (int32_t)data[0] * 1.0 / 65536.0;  // Pitch: -180 to 180
    features.euler[1] = (int32_t)data[1] * 1.0 / 65536.0;   // Roll: -90 to 90
    features.euler[2] = (int32_t)data[2] * 1.0 / 65536.0;    // Yaw: -180 to 180
    features.euler_data[0] = (int32_t)data[0];
    features.euler_data[1] = (int32_t)data[1];
    features.euler_data[2] = (int32_t)data[2];
    features.euler_ts = timestamp;

    data_update |= MOTIONFUSION_EULER;;

    // PRINTF("[mpu9250 arch] Pitch/Roll/Yaw: %f %f %f\n",
    //     features.euler[0], features.euler[1], features.euler[2]);
  }

  if (inv_get_sensor_type_heading(data, &accuracy, &timestamp)) {
    features.heading = (int32_t)data[0] * 1.0 / 65536.0;
    features.heading_data = (int32_t)data[0];
    features.heading_ts = timestamp;

    data_update |= MOTIONFUSION_HEADING;

    // PRINTF("[mpu9250 arch] heading: %f\n", features.heading);
  }

  if (inv_get_sensor_type_linear_acceleration(float_data, &accuracy, &timestamp)) {
    features.linear_accel[0] = float_data[0];
    features.linear_accel[1] = float_data[1];
    features.linear_accel[2] = float_data[2];
    features.linear_accel_ts = timestamp;

    data_update |= MOTIONFUSION_LINEAR_ACCEL;

    // PRINTF("[mpu9250 arch] Linear Accel: %f %f %f\n", float_data[0], float_data[1], float_data[2]);
  }

  if (inv_get_sensor_type_gravity(float_data, &accuracy, &timestamp)) {
    features.gravity[0] = float_data[0];
    features.gravity[1] = float_data[2];
    features.gravity[2] = float_data[2];
    features.gravity_ts = timestamp;
    data_update |= MOTIONFUSION_GRAVITY_VECTOR;
    // PRINTF("[mpu9250 arch] Gravity Vector: %f %f %f\n",
    //     float_data[0], float_data[1], float_data[2]);
  }

  timestamp = clock_time();
  if (timestamp > hal.next_pedo_ms) {
    hal.next_pedo_ms = timestamp + PEDO_READ_MS;
    unsigned long step_count, walk_time;
    dmp_get_pedometer_step_count(&step_count);
    dmp_get_pedometer_walk_time(&walk_time);
    // PRINTF("[mpu9250 arch] Walked %ld steps over %ld ms\n", step_count, walk_time);
  }

  if (data_update) {
    if (m_framework_raw_data_func != NULL) {
      m_framework_raw_data_func(data_update);
    }
  }

}
/*---------------------------------------------------------------------------*/
static void
mpu9250_int_event_handler(gpiote_event_t *event)
{
  uint32_t pin_mask = (1u << MPU_INT);
  if (event->pin_no == pin_mask) {
    if (motion_active) {
      if (hal.motion_int_mode) {
        /* Restore the previous sensor configuration. */
        mpu_lp_motion_interrupt(0, 0, 0);
        hal.motion_int_mode = 0;
        process_post(&mpu9250_process, mpu9250_sensor_event, NULL);
      } else {
        hal.new_gyro = 1;
        process_post(&mpu9250_process, mpu9250_sensor_event, NULL);
      }
    }
  }
}
/*---------------------------------------------------------------------------*/
static gpiote_handle_t gpioteh = {.event_handler=mpu9250_int_event_handler,
								  .pins_mask = (1U << MPU_INT),
								  .pins_low_to_high_mask= (1U << MPU_INT),
								  .pins_high_to_low_mask= 0,
								  .sense_high_pins = 0 };
/*---------------------------------------------------------------------------*/
static void
tap_cb(unsigned char direction, unsigned char count)
{
  switch (direction) {
  case TAP_X_UP:
    PRINTF("[mpu9250 arch] Tap X+\n");
    break;
  case TAP_X_DOWN:
    PRINTF("[mpu9250 arch] Tap X- \n");
    break;
  case TAP_Y_UP:
    PRINTF("[mpu9250 arch] Tap Y+\n");
    break;
  case TAP_Y_DOWN:
    PRINTF("[mpu9250 arch] Tap Y-\n");
    break;
  case TAP_Z_UP:
    PRINTF("[mpu9250 arch] Tap Z+\n");
    break;
  case TAP_Z_DOWN:
    PRINTF("[mpu9250 arch] Tap Z-\n");
    break;
  default:
    return;
  }
  PRINTF("[mpu9250 arch] tap_cb x%d\n", count);
  return;
}
/*---------------------------------------------------------------------------*/
static void
android_orient_cb(unsigned char orientation)
{
	switch (orientation) {
	case ANDROID_ORIENT_PORTRAIT:
    PRINTF("[mpu9250 arch] Portrait\n");
    break;
	case ANDROID_ORIENT_LANDSCAPE:
    PRINTF("[mpu9250 arch] Landscape\n");
    break;
	case ANDROID_ORIENT_REVERSE_PORTRAIT:
    PRINTF("[mpu9250 arch] Reverse Portrait\n");
    break;
	case ANDROID_ORIENT_REVERSE_LANDSCAPE:
    PRINTF("[mpu9250 arch] Reverse Landscape\n");
    break;
	default:
		return;
	}
}
/*---------------------------------------------------------------------------*/
PROCESS_THREAD(mpu9250_process, ev, data)
{
  static int errcode;
  static uint8_t new_temp = 0, new_compass = 0;
  static uint32_t timestamp;
  static uint32_t sensor_timestamp;
  static int new_data = 0;
  static uint8_t accel_fsr;
  static uint16_t gyro_rate, gyro_fsr, compass_fsr;

	PROCESS_BEGIN();

	mpu_init(NULL);
	/* If you're not using an MPU9150 AND you're not using DMP features, this
		* function will place all slaves on the primary bus.
		* mpu_set_bypass(1);
	*/
	errcode = inv_init_mpl();
	if (errcode) {
		PRINTF("[mpu9250 arch] Could not initialize MPL.\n");
	}

	// Compute 6-axis and 9-axis quaternions.
	inv_enable_quaternion();
	inv_enable_9x_sensor_fusion();

	// MPL will depend on the timestamps passed to inv_build_compass instead.
	// inv_9x_fusion_use_timestamps(1);

	/* Update gyro biases when not in motion.
		* WARNING: These algorithms are mutually exclusive.
		*/
	inv_enable_fast_nomot();

