AlfaLoop/alfabase/arch/cortex-m0/nrf51822/dev/sensor/mpu9250-motion-arch.c
	/* Update gyro biases when temperature changes. */
	inv_enable_gyro_tc();

	/* Compass calibration algorithms. */
	inv_enable_vector_compass_cal();
	inv_enable_magnetic_disturbance();

  inv_enable_eMPL_outputs();

	errcode = inv_start_mpl();
	if (errcode == INV_ERROR_NOT_AUTHORIZED) {
		while (1) {
			PRINTF("[mpu9250 arch] Not authorized.\n");
		}
	}
	if (errcode) {
		PRINTF("Could not start the MPL.\n");
	}

	mpu_set_sensors(INV_XYZ_GYRO | INV_XYZ_ACCEL | INV_XYZ_COMPASS);

	// Push both gyro and accel data into the FIFO.
	mpu_configure_fifo(INV_XYZ_GYRO | INV_XYZ_ACCEL);
	mpu_set_sample_rate(DEFAULT_MPU_HZ);

	/* The compass sampling rate can be less than the gyro/accel sampling rate.
	 * Use this function for proper power management.
	 */
	mpu_set_compass_sample_rate(1000 / COMPASS_READ_MS);

	// Read back configuration in case it was set improperly.
	mpu_get_sample_rate(&gyro_rate);
	mpu_get_gyro_fsr(&gyro_fsr);
	mpu_get_accel_fsr(&accel_fsr);
	mpu_get_compass_fsr(&compass_fsr);

	/* Sync driver configuration with MPL. */
	/* Sample rate expected in microseconds. */
	inv_set_gyro_sample_rate(1000000L / gyro_rate);
	inv_set_accel_sample_rate(1000000L / gyro_rate);

	/* The compass rate is independent of the gyro and accel rates. As long as
   * inv_set_compass_sample_rate is called with the correct value, the 9-axis
   * fusion algorithm's compass correction gain will work properly.
   */
	inv_set_compass_sample_rate(COMPASS_READ_MS * 1000L);

  /* Set chip-to-body orientation matrix.
    * Set hardware units to dps/g's/degrees scaling factor.
    */
  inv_set_gyro_orientation_and_scale(
         inv_orientation_matrix_to_scalar(gyro_pdata.orientation),
         (long)gyro_fsr<<15);
  inv_set_accel_orientation_and_scale(
         inv_orientation_matrix_to_scalar(gyro_pdata.orientation),
         (long)accel_fsr<<15);
  inv_set_compass_orientation_and_scale(
         inv_orientation_matrix_to_scalar(compass_pdata.orientation),
         (long)compass_fsr<<15);

  hal.sensors = ACCEL_ON | GYRO_ON | COMPASS_ON;
  hal.dmp_on = 0;
  hal.next_pedo_ms = 0;
  hal.next_compass_ms = 0;
  hal.next_temp_ms = 0;

  timestamp = clock_time();

  /* To initialize the DMP:
     * 1. Call dmp_load_motion_driver_firmware(). This pushes the DMP image in
     *    inv_mpu_dmp_motion_driver.h into the MPU memory.
     * 2. Push the gyro and accel orientation matrix to the DMP.
     * 3. Register gesture callbacks. Don't worry, these callbacks won't be
     *    executed unless the corresponding feature is enabled.
     * 4. Call dmp_enable_feature(mask) to enable different features.
     * 5. Call dmp_set_fifo_rate(freq) to select a DMP output rate.
     * 6. Call any feature-specific control functions.
     *
     * To enable the DMP, just call mpu_set_dmp_state(1). This function can
     * be called repeatedly to enable and disable the DMP at runtime.
     *
     * The following is a short summary of the features supported in the DMP
     * image provided in inv_mpu_dmp_motion_driver.c:
     * DMP_FEATURE_LP_QUAT: Generate a gyro-only quaternion on the DMP at
     * 200Hz. Integrating the gyro data at higher rates reduces numerical
     * errors (compared to integration on the MCU at a lower sampling rate).
     * DMP_FEATURE_6X_LP_QUAT: Generate a gyro/accel quaternion on the DMP at
     * 200Hz. Cannot be used in combination with DMP_FEATURE_LP_QUAT.
     * DMP_FEATURE_TAP: Detect taps along the X, Y, and Z axes.
     * DMP_FEATURE_ANDROID_ORIENT: Google's screen rotation algorithm. Triggers
     * an event at the four orientations where the screen should rotate.
     * DMP_FEATURE_GYRO_CAL: Calibrates the gyro data after eight seconds of
     * no motion.
     * DMP_FEATURE_SEND_RAW_ACCEL: Add raw accelerometer data to the FIFO.
     * DMP_FEATURE_SEND_RAW_GYRO: Add raw gyro data to the FIFO.
     * DMP_FEATURE_SEND_CAL_GYRO: Add calibrated gyro data to the FIFO. Cannot
     * be used in combination with DMP_FEATURE_SEND_RAW_GYRO.
     */
  dmp_load_motion_driver_firmware();
  dmp_set_orientation(
      inv_orientation_matrix_to_scalar(gyro_pdata.orientation));
  dmp_register_tap_cb(tap_cb);
  dmp_register_android_orient_cb(android_orient_cb);

  hal.dmp_features = DMP_FEATURE_6X_LP_QUAT | DMP_FEATURE_TAP |
        DMP_FEATURE_ANDROID_ORIENT | DMP_FEATURE_SEND_RAW_ACCEL | DMP_FEATURE_SEND_CAL_GYRO |
        DMP_FEATURE_GYRO_CAL;
  dmp_enable_feature(hal.dmp_features);
  dmp_set_fifo_rate(DEFAULT_MPU_HZ);
  unsigned short sample_rate;
  mpu_get_sample_rate(&sample_rate);
  inv_set_quat_sample_rate(1000000L / sample_rate);
  mpu_set_dmp_state(1);
  hal.dmp_on = 1;
  motion_active = true;

  /* Reset pedometer. */
  dmp_set_pedometer_step_count(0);
  dmp_set_pedometer_walk_time(0);

	while(1) {
		PROCESS_WAIT_EVENT_UNTIL(ev == mpu9250_sensor_event);
    do {

      timestamp = clock_time();

      /* We're not using a data ready interrupt for the compass, so we'll
       * make our compass reads timer-based instead.
      */
      if ((timestamp > hal.next_compass_ms) && !hal.lp_accel_mode &&
        hal.new_gyro && (hal.sensors & COMPASS_ON)) {
        hal.next_compass_ms = timestamp + COMPASS_READ_MS;
        new_compass = 1;
      }

      /* Temperature data doesn't need to be read with every gyro sample.
       * Let's make them timer-based like the compass reads.
      */
      if (timestamp > hal.next_temp_ms) {
        hal.next_temp_ms = timestamp + TEMP_READ_MS;
        new_temp = 1;
      }

      if (hal.motion_int_mode) {
        /* Enable motion interrupt. */
        mpu_lp_motion_interrupt(500, 1, 5);
        /* Notify the MPL that contiguity was broken. */
        inv_accel_was_turned_off();
        inv_gyro_was_turned_off();
        inv_compass_was_turned_off();
        inv_quaternion_sensor_was_turned_off();
        /* Wait for the MPU interrupt. */
        PROCESS_WAIT_EVENT_UNTIL(ev == mpu9250_sensor_event);
        /* Restore the previous sensor configuration. */
        mpu_lp_motion_interrupt(0, 0, 0);
        hal.motion_int_mode = 0;
      }

