AlfaLoop/alfabase/arch/cortex-m0/nrf51822/dev/sensor/mpu9250-motion-arch.c
      if (hal.new_gyro && hal.lp_accel_mode) {
        short accel_short[3];
        long accel[3];
        mpu_get_accel_reg(accel_short, &sensor_timestamp);
        accel[0] = (long)accel_short[0];
        accel[1] = (long)accel_short[1];
        accel[2] = (long)accel_short[2];
        inv_build_accel(accel, 0, sensor_timestamp);
        new_data = 1;
        hal.new_gyro = 0;
      } else if (hal.new_gyro && hal.dmp_on) {
        short gyro[3], accel_short[3], sensors;
        unsigned char more;
        long accel[3], quat[4], temperature;
        /* This function gets new data from the FIFO when the DMP is in
         * use. The FIFO can contain any combination of gyro, accel,
         * quaternion, and gesture data. The sensors parameter tells the
         * caller which data fields were actually populated with new data.
         * For example, if sensors == (INV_XYZ_GYRO | INV_WXYZ_QUAT), then
         * the FIFO isn't being filled with accel data.
         * The driver parses the gesture data to determine if a gesture
         * event has occurred; on an event, the application will be notified
         * via a callback (assuming that a callback function was properly
         * registered). The more parameter is non-zero if there are
         * leftover packets in the FIFO.
         */
        dmp_read_fifo(gyro, accel_short, quat, &sensor_timestamp, &sensors, &more);
        if (!more)
            hal.new_gyro = 0;
        if (sensors & INV_XYZ_GYRO) {
          /* Push the new data to the MPL. */
          inv_build_gyro(gyro, sensor_timestamp);
          new_data = 1;
          if (new_temp) {
            new_temp = 0;
            /* Temperature only used for gyro temp comp. */
            mpu_get_temperature(&temperature, &sensor_timestamp);
            inv_build_temp(temperature, sensor_timestamp);
          }
        }
        if (sensors & INV_XYZ_ACCEL) {
          accel[0] = (long)accel_short[0];
          accel[1] = (long)accel_short[1];
          accel[2] = (long)accel_short[2];
          inv_build_accel(accel, 0, sensor_timestamp);
          new_data = 1;
        }
        if (sensors & INV_WXYZ_QUAT) {
          inv_build_quat(quat, 0, sensor_timestamp);
          new_data = 1;
        }
      } else if (hal.new_gyro) {
        short gyro[3], accel_short[3];
        unsigned char sensors, more;
        long accel[3], temperature;
        /* This function gets new data from the FIFO. The FIFO can contain
         * gyro, accel, both, or neither. The sensors parameter tells the
         * caller which data fields were actually populated with new data.
         * For example, if sensors == INV_XYZ_GYRO, then the FIFO isn't
         * being filled with accel data. The more parameter is non-zero if
         * there are leftover packets in the FIFO. The HAL can use this
         * information to increase the frequency at which this function is
         * called.
         */
        hal.new_gyro = 0;
        mpu_read_fifo(gyro, accel_short, &sensor_timestamp, &sensors, &more);
        if (more)
          hal.new_gyro = 1;
        if (sensors & INV_XYZ_GYRO) {
          /* Push the new data to the MPL. */
          inv_build_gyro(gyro, sensor_timestamp);
          new_data = 1;
          if (new_temp) {
            new_temp = 0;
            /* Temperature only used for gyro temp comp. */
            mpu_get_temperature(&temperature, &sensor_timestamp);
            inv_build_temp(temperature, sensor_timestamp);
          }
        }
        if (sensors & INV_XYZ_ACCEL) {
          accel[0] = (long)accel_short[0];
          accel[1] = (long)accel_short[1];
          accel[2] = (long)accel_short[2];
          inv_build_accel(accel, 0, sensor_timestamp);
          new_data = 1;
        }
      }

      if (new_compass) {
        short compass_short[3];
        long compass[3];
        new_compass = 0;
        /* For any MPU device with an AKM on the auxiliary I2C bus, the raw
         * magnetometer registers are copied to special gyro registers.
         */
        if (!mpu_get_compass_reg(compass_short, &sensor_timestamp)) {
            compass[0] = (long)compass_short[0];
            compass[1] = (long)compass_short[1];
            compass[2] = (long)compass_short[2];
            /* NOTE: If using a third-party compass calibration library,
             * pass in the compass data in uT * 2^16 and set the second
             * parameter to INV_CALIBRATED | acc, where acc is the
             * accuracy from 0 to 3.
             */
            inv_build_compass(compass, 0, sensor_timestamp);
        }
        new_data = 1;
      }

      if (new_data) {
        // PRINTF("[mpu9250 proc] new data \n");
        inv_execute_on_data();
        /* This function reads bias-compensated sensor data and sensor
         * fusion outputs from the MPL. The outputs are formatted as seen
         * in eMPL_outputs.c. This function only needs to be called at the
         * rate requested by the host.
         */
        read_from_mpl();
      }

    } while (hal.new_gyro);

	}
	PROCESS_END();
}
/*---------------------------------------------------------------------------*/
int
mpu9250_arch_init(motionfusion_config_t *config)
{
	// initialize i2c interface
  nrf_gpio_cfg_input(MPU_INT, NRF_GPIO_PIN_NOPULL);

  nrf_gpio_cfg_output(MPU_CS);
  nrf_gpio_pin_set(MPU_CS);

  i2c_config_t twi;
  twi.scl = MPU_SCL;
  twi.sda = MPU_SDA;
  twi.speed = 0;
  TWI.init(&twi);

  // spi_master_config_t spi_config;
	// spi_config.freq =  SPI_FREQUENCY_M4;
	// spi_config.sck_pin = MPU_SCL;
	// spi_config.mosi_pin = MPU_SDA;
	// spi_config.miso_pin = MPU_AUX;
	// spi_config.irq_priority = 6;
	// spi_config.order = SPI_MSB;
	// spi_config.mode = SPI_MODE0;
  // spi_config.cs_pin = MPU_CS;
	// spi1_driver.init(&spi_config);

	if (config->framework_raw_data_source != NULL) {
	  m_framework_raw_data_func = config->framework_raw_data_source;
	} else {
		m_framework_raw_data_func = NULL;
	}

  gpiote_register(&gpioteh);

  mpu9250_sensor_event = process_alloc_event();
  if (!process_is_running(&mpu9250_process)) {
    process_start(&mpu9250_process, NULL);
  }
  // mpu_init(NULL);
  // mpu_set_sensors(0);
	return ENONE;
}
/*---------------------------------------------------------------------------*/
int
mpu9250_arch_poweron(void)
{
  int errcode;
  unsigned char mask = 0, lp_accel_was_on = 0;
  unsigned short sample_rate;

	if (motion_active) {
		return EINVALSTATE;
	}

