AlfaLoop/alfabase/arch/cortex-m0/nrf51822/dev/sensor/mpu9250-motion-arch.c
  hal.sensors = ACCEL_ON | GYRO_ON | COMPASS_ON;
  mask |= INV_XYZ_ACCEL;
  mask |= INV_XYZ_GYRO;
  lp_accel_was_on |= hal.lp_accel_mode;
  mask |= INV_XYZ_COMPASS;
  lp_accel_was_on |= hal.lp_accel_mode;

  /* If you need a power transition, this function should be called with a
   * mask of the sensors still enabled. The driver turns off any sensors
   * excluded from this mask.
   */
  mpu_set_sensors(mask);
  mpu_configure_fifo(mask);
  if (lp_accel_was_on) {
    unsigned short rate;
    hal.lp_accel_mode = 0;
    /* Switching out of LP accel, notify MPL of new accel sampling rate. */
    mpu_get_sample_rate(&rate);
    inv_set_accel_sample_rate(1000000L / rate);
  }

  hal.dmp_on = 1;
  /* Preserve current FIFO rate. */
  mpu_get_sample_rate(&sample_rate);
  dmp_set_fifo_rate(sample_rate);
  inv_set_quat_sample_rate(1000000L / sample_rate);
  mpu_set_dmp_state(1);
  PRINTF("[mpu9250 arch] DMP enabled.\n");

	motion_active = true;
}
/*---------------------------------------------------------------------------*/
int
mpu9250_arch_poweroff(bool enable_wakeup_threshold)
{
  if (!motion_active)
		return EINVALSTATE;

  if (enable_wakeup_threshold) {
    hal.motion_int_mode = 1;

    /* System Off? */
  } else {
    // Disable DMP and Enable LP accel mode
    unsigned short dmp_rate;
    unsigned char mask = 0;
    hal.dmp_on = 0;
    mpu_set_dmp_state(0);
    /* Restore FIFO settings. */
    if (hal.sensors & ACCEL_ON)
        mask |= INV_XYZ_ACCEL;
    if (hal.sensors & GYRO_ON)
        mask |= INV_XYZ_GYRO;
    if (hal.sensors & COMPASS_ON)
        mask |= INV_XYZ_COMPASS;
    mpu_configure_fifo(mask);
    /* When the DMP is used, the hardware sampling rate is fixed at
     * 200Hz, and the DMP is configured to downsample the FIFO output
     * using the function dmp_set_fifo_rate. However, when the DMP is
     * turned off, the sampling rate remains at 200Hz. This could be
     * handled in inv_mpu.c, but it would need to know that
     * inv_mpu_dmp_motion_driver.c exists. To avoid this, we'll just
     * put the extra logic in the application layer.
     */
    dmp_get_fifo_rate(&dmp_rate);
    mpu_set_sample_rate(dmp_rate);
    inv_quaternion_sensor_was_turned_off();
    PRINTF("[mpu9250 arch] DMP disabled.\n");

    mpu_lp_accel_mode(1);
    /* When LP accel mode is enabled, the driver automatically configures
     * the hardware for latched interrupts. However, the MCU sometimes
     * misses the rising/falling edge, and the hal.new_gyro flag is never
     * set. To avoid getting locked in this state, we're overriding the
     * driver's configuration and sticking to unlatched interrupt mode.
     *
     * TODO: The MCU supports level-triggered interrupts.
     */
    mpu_set_int_latched(0);
    hal.sensors &= ~(GYRO_ON|COMPASS_ON);
    hal.sensors |= ACCEL_ON;
    hal.lp_accel_mode = 1;
    inv_gyro_was_turned_off();
    inv_compass_was_turned_off();
  }

	// gpiote_unregister(&gpioteh);
	motion_active = false;
	// nrf_gpio_cfg_input(MPU_INT, NRF_GPIO_PIN_NOPULL);
	// mpu_set_sensors(0);
}
/*---------------------------------------------------------------------------*/
int
mpu9250_config_update(uint32_t type, uint32_t value)
{
  if (type == DEV_MOTION_CONFIG_SAMPLEING_RATE_TYPE) {
    if (value == DEV_MOTION_RATE_DISABLE) {

    } else if (value == DEV_MOTION_RATE_10hz) {
      if (hal.dmp_on) {
          dmp_set_fifo_rate(10);
          inv_set_quat_sample_rate(100000L);
      } else {
        mpu_set_sample_rate(10);
      }
      inv_set_gyro_sample_rate(100000L);
      inv_set_accel_sample_rate(100000L);
    } else if (value == DEV_MOTION_RATE_20hz) {
      if (hal.dmp_on) {
        dmp_set_fifo_rate(20);
        inv_set_quat_sample_rate(50000L);
      } else {
        mpu_set_sample_rate(20);
      }
      inv_set_gyro_sample_rate(50000L);
      inv_set_accel_sample_rate(50000L);
    } else if (value == DEV_MOTION_RATE_40hz) {
      if (hal.dmp_on) {
        dmp_set_fifo_rate(40);
        inv_set_quat_sample_rate(25000L);
      } else {
        mpu_set_sample_rate(40);
      }
      inv_set_gyro_sample_rate(25000L);
      inv_set_accel_sample_rate(25000L);
    } else if (value == DEV_MOTION_RATE_50hz) {
      if (hal.dmp_on) {
        dmp_set_fifo_rate(50);
        inv_set_quat_sample_rate(20000L);
      } else {
        mpu_set_sample_rate(50);
      }
      inv_set_gyro_sample_rate(20000L);
      inv_set_accel_sample_rate(20000L);
    } else if (value == DEV_MOTION_RATE_100hz) {
      if (hal.dmp_on) {
          dmp_set_fifo_rate(100);
          inv_set_quat_sample_rate(10000L);
      } else {
        mpu_set_sample_rate(100);
      }
      inv_set_gyro_sample_rate(10000L);
      inv_set_accel_sample_rate(10000L);
    } else {

    }
  } else if (type == DEV_MOTION_CONFIG_RESET_PEDOMETER_TYPE) {
    /* Reset pedometer. */
    dmp_set_pedometer_step_count(0);
    dmp_set_pedometer_walk_time(0);
  }
}
/*---------------------------------------------------------------------------*/
bool
mpu9250_activated(void)
{
	return motion_active;
}
/*---------------------------------------------------------------------------*/
int
mpu9250_get_accel(float *values, int32_t *data, uint32_t *timestamp)
{
  values[0] = features.accel[0];
  values[1] = features.accel[1];
  values[2] = features.accel[2];
  data[0] = features.accel_data[0];
  data[1] = features.accel_data[1];
  data[2] = features.accel_data[2];
  *timestamp = features.accel_ts;
	return ENONE;
}
/*---------------------------------------------------------------------------*/
int
mpu9250_get_gyro(float *values, int32_t *data, uint32_t *timestamp)
{
  values[0] = features.gyro[0];
  values[1] = features.gyro[1];
  values[2] = features.gyro[2];
  data[0] = features.gyro_data[0];
  data[1] = features.gyro_data[1];
  data[2] = features.gyro_data[2];
  *timestamp = features.gyro_ts;
	return ENONE;
}
/*---------------------------------------------------------------------------*/
int
mpu9250_get_compass(float *values, int32_t *data, uint32_t *timestamp)
{
  values[0] = features.compass[0];
  values[1] = features.compass[1];
  values[2] = features.compass[2];
  data[0] = features.compass_data[0];
  data[1] = features.compass_data[1];
  data[2] = features.compass_data[2];
  *timestamp = features.compass_ts;
	return ENONE;
}
/*---------------------------------------------------------------------------*/
int
mpu9250_get_quaternion(float *values, int32_t *data, uint32_t *timestamp)
{
  values[0] = features.quat[0];
  values[1] = features.quat[1];
  values[2] = features.quat[2];
  values[3] = features.quat[3];
  data[0] = features.quat_data[0];
  data[1] = features.quat_data[1];
  data[2] = features.quat_data[2];
  data[3] = features.quat_data[3];

  *timestamp = features.quat_ts;
  return ENONE;
}
/*---------------------------------------------------------------------------*/
int
mpu9250_get_euler(float *values, int32_t *data, uint32_t *timestamp)
{
  values[0] = features.euler[0];
  values[1] = features.euler[1];
  values[2] = features.euler[2];
  data[0] = features.euler_data[0];
  data[1] = features.euler_data[1];
  data[2] = features.euler_data[2];

  *timestamp = features.euler_ts;
  return ENONE;
}
/*---------------------------------------------------------------------------*/
int
mpu9250_get_linear_accel(float *values, uint32_t *timestamp)
{
  values[0] = features.linear_accel[0];
  values[1] = features.linear_accel[1];
  values[2] = features.linear_accel[2];

  *timestamp = features.linear_accel_ts;
  return ENONE;
}
/*---------------------------------------------------------------------------*/
int
mpu9250_get_gravity_vector(float *values, uint32_t *timestamp)
{
  values[0] = features.gravity[0];
  values[1] = features.gravity[1];
  values[2] = features.gravity[2];

  *timestamp = features.gravity_ts;
  return ENONE;
}
/*---------------------------------------------------------------------------*/
int
mpu9250_get_heading(float *value, int32_t *data, uint32_t *timestamp)
{
  *value = features.heading;
  *data = features.heading_data;
  *timestamp = features.heading_ts;
  return ENONE;
}
/*---------------------------------------------------------------------------*/
